In [1]:
import pandas as pd
import numpy as np

In [4]:
df1=pd.DataFrame({'key':['A','B','A','D'],'data':[30,56,34,23]})

In [5]:
df1

  key  data
0   A    30
1   B    56
2   A    34
3   D    23

In [8]:
df2=pd.DataFrame([53,75],index=['A','D'],columns=['data2'])

In [9]:
df2

   data2
A     53
D     75

In [10]:
pd.merge(df1,df2,left_on='key',right_index=True,how='outer')

  key  data  data2
0   A    30   53.0
2   A    34   53.0
1   B    56    NaN
3   D    23   75.0

In [11]:
df3=pd.DataFrame({'key1':['A','B','C','A'],'key2':[1,2,2,2],'data':[10,42,42,54]})

In [12]:
df3

  key1  key2  data
0    A     1    10
1    B     2    42
2    C     2    42
3    A     2    54

In [15]:
df4=pd.DataFrame(range(4),index=[['A','A','B','D'],[1,2,1,1]],columns=['data2'])

In [16]:
df4

     data2
A 1      0
  2      1
B 1      2
D 1      3

In [17]:
pd.merge(df3,df4,left_on=['key1','key2'],right_index=True,how='outer')

  key1  key2  data  data2
0    A     1  10.0    0.0
1    B     2  42.0    NaN
2    C     2  42.0    NaN
3    A     2  54.0    1.0
3    B     1   NaN    2.0
3    D     1   NaN    3.0

In [18]:
df1.join(df2)

  key  data  data2
0   A    30    NaN
1   B    56    NaN
2   A    34    NaN
3   D    23    NaN